export const questionList = [
  {
    id: 1,
    question: `나 캐로... <br/> 왜 오늘따라 커피가 땡길까?`,
    answerList: [
      {
        text: "어제 야근하다 보니 오늘 너무 피곤해 ㅠㅠ",
        score: 2,
      },
      {
        text: "어제 친구랑 너무 달렸어 해장커피가 짱이야!",
        score: 3,
      },
      {
        text: "늘 아침엔 커피 한잔의 여유가 필요한 법이지 :D",
        score: 1,
      },
    ],
  },
  {
    id: 2,
    question: `그때 갑자기 친구가 <br/>카페에 가자고 연락이 왔다!`,
    answerList: [
      {
        text: "어? 그럼 같이 가야지",
        score: 2,
      },
      {
        text: "아니야 혼자 커피를 즐기고 싶어",
        score: 1,
      },
    ],
  },
  {
    id: 3,
    question: `어쨋든 카페로 가기로 한 당신!<br/> 어디로 가볼까?`,
    answerList: [
      {
        text: "카페는 분위기지! 당장 인스타에 핫플레이스 검색",
        score: 1,
      },
      {
        text: "지도앱에서 평점으로 걸러걸러!",
        score: 1,
      },
      {
        text: "고민은 노! 일단 떠나자",
        score: 2,
      },
    ],
  },
  {
    id: 4,
    question: `몇 군데 마음에 드는 카페가 생겼다!<br/> 어디로 가지?`,
    answerList: [
      {
        text: "뷰가 맛있는 뷰맛집!",
        score: 0,
      },
      {
        text: "커피 리뷰가 좋은 커피맛집!",
        score: 0,
      },
      {
        text: "알바생이 잘났구만 얼굴맛집!",
        score: 0,
      },
      {
        text: "카페는 뭐니뭐니해도 브금이 좋아야지! 브금맛집!",
        score: 0,
      },
    ],
  },
  {
    id: 5,
    question: `[뷰/커피/얼굴/브금]맛집으로 <br/>가기로 한 당신! 엇 후보군이 두개!`,
    answerList: [
      {
        text: "넓고 테이블 많은 대형 카페가 좋지!",
        score: 0,
      },
      {
        text: "작고 아담한 개인카페가 최고야!",
        score: 0,
      },
    ],
  },
  {
    id: 6,
    question: `카페를 정하고 지도를 검색했는데,<br/> 어? 버스 세 정류장 ... ??`,
    answerList: [
      {
        text: "집주변의 새로운 카페를 찾는다",
        score: 2,
      },
      {
        text: "세 정류장 쯤이야! 레쓰고!",
        score: 1,
      },
    ],
  },
  {
    id: 7,
    question: `카페에 도착했으니까 <br/>이제 주문을 해볼까?`,
    answerList: [
      {
        text: "시그니처는 특별한게 있을거야! 카페 추천메뉴 고고",
        score: 1,
      },
      {
        text: "고민고민하지마! 항상 먹던 바로 그 메뉴!",
        score: 3,
      },
      {
        text: "어? 오늘의 메뉴 할인되네? 개이득!",
        score: 2,
      },
      {
        text: "이건 뭐지? 못 보던 신메뉴네! 바로 도전!",
        score: 4,
      },
    ],
  },
  {
    id: 8,
    question: `“300원만 추가하면 투명 친환경<br/> 소재 컵으로 바꿔드려요” 사장님의 <br/>깜짝 질문! 내 대답은?`,
    answerList: [
      {
        text: "300원...? 너무 비싼데.. “아니요! 그냥 주세요”",
        score: 2,
      },
      {
        text: "300원.. 비싸지만 이거라도 해야지 “네! 해주세요!”",
        score: 1,
      },
    ],
  },
  {
    id: 9,
    question: `주문을 했으니 자리에 앉아야지! <br/>어디앉지? 보자보자..`,
    answerList: [
      {
        text: "휴대폰 없이 못살아! 콘센트 주변",
        score: 0,
      },
      {
        text: "대대익선! 테이블에 올려둘게 너무 많아! 넓은 테이블",
        score: 0,
      },
      {
        text: "비타민D가 부족해! 창가에 가서 광합성 해야지",
        score: 0,
      },
      {
        text: "무조건 편안한게 최고지! 폭신한 소파로 달려",
        score: 0,
      },
    ],
  },
  {
    id: 10,
    question: `카페에 앉아서 나는 주로...`,
    answerList: [
      {
        text: "이 집 커피는 어디 원두일까? 커피 맛을 음미한다",
        score: 2,
      },
      {
        text: "여기서 찍으면 인생샷? 사진을 찍는다",
        score: 3,
      },
      {
        text: "커피고 나발이고 노트북 올려올려! 일하라 개미",
        score: 1,
      },
      {
        text: "같이 온 친구랑 부리 털기 시작",
        score: 3,
      },
    ],
  },
  {
    id: 11,
    question: `이 집 커피 JMT!<br/> 세상에 이런 커피가 있다니!`,
    answerList: [
      {
        text: "당장 SNS/단톡에 자랑한다!",
        score: 3,
      },
      {
        text: "인증샷 찍어서 내 갤러리에 저-장",
        score: 1,
      },
      {
        text: "내 맛집지도로 가랏! 지도앱에서 당장 북마크",
        score: 2,
      },
    ],
  },
  {
    id: 12,
    question: `이제 다 먹었으니까 일어나야지!`,
    answerList: [
      {
        text: "반납은 직원에게! 트레이 째로",
        score: 0,
      },
      {
        text: `반납은 셀프반납!<br/> 음료버리고 쓰레기 정리하고 마지막 쟁반 정렬`,
        score: 0,
      },
    ],
  },
];

export const resultList = [
  {
    // 콜드브루
    id: 1,
    score_min: 20,
    score_max: 999,
    title: "콜드브루",
    sub_title: "“깐깐한 평론가인 당신은 콜드브루”",
    contents: [
      "불편한 점이 있으면 참지 않아요. 차분하고 정돈된 어조로 논리 정연하게 컴플레인을 걸어요.",
      "나만의 평가 항목이 있어요. 이 카페는 별점 4.7점, 이 카페는 별점 1.2점!",
      "검증된 카페에 가고 싶어요. 항상 가던 카페에 가거나, 인터넷에서 열심히 검색해서 리뷰를 보고 카페를 결정해요.",
      "시간을 허투루 쓰기 싫어요. 카페를 쉬러간다니..? 그럴 수 없어요. 카페는 목적이 있어야 가요.",
      "내 잔소리는 애정의 척도! 소중한 사람에게 잔소리가 더 심해요. 관심이 없으면 아웃오브안중! 잔소리도 없어요.",
      "길에서 어디가지? 방황하는 것은 비효율적 이라고 생각해요. 무조건 다음 장소는 예약 하거나, 최소한 확실하게 정하고 움직여요.",
      "청결이 제일 중요해서 깔끔하지 않은 주방/직원이 있는 카페는 절대 다시는 안가요.",
    ],
    like: 6,
    hate: 8,
  },
  {
    // 카페 로열
    id: 2,
    score_min: 19,
    score_max: 20,
    title: "카페 로얄",
    sub_title: "“자신감이 넘쳐흐르는 당신은 카페 로얄”",
    contents: [
      "자유를 추구하고 억압에 저항하는 타고난 모험가로 오늘의 기분에 따라 새로운 카페를 찾아 방황하기도 해요.",
      "상상력, 창의력 최상! 순발력도 뛰어난 다재다능러라 어려운 일이 별로 없어요.",
      "가끔은 카페에서 책을 읽거나 공부를 하며 혼자만의 시간을 즐기는 것도 좋아요. 내 모습이 프로 갓생러 같아서 너무 멋지니까!",
      "카페에서는 부리털기가 제맛! 순간적인 재치와 기발함으로 무장한 어나더레벨의 말빨로 대화를 매력적으로 이끌어가요.",
      "넘치는 자신감으로 자신을 표현하는 당신! 때로는 자아도취 나르시스트로 오해받기도 해요.",
      "가치관이 뚜렷한 당신! BGM.. 향기.. 인테리어.. 이 카페가 좋은 101가지 이유를 이야기 할 수 있어요.",
      "새로운 카페에 도전하는 것은 좋아하지만, 인터넷에 찾아보긴 싫어요. 어? 이 카페 괜찮 은데? 싶으면 바로 들어가는 게 더 재밌어요.",
    ],
    like: 8,
    hate: 5,
  },
  {
    // 따뜻한 캬라멜 마키아또
    id: 3,
    score_min: 17,
    score_max: 19,
    title: "따뜻한 카라멜 마키아또",
    sub_title: "“커피 한 잔으로 따뜻함을 전하는 당신은 따뜻한 카라멜 마키아또”",
    contents: [
      "온화하고 책임감이 많은 당신. 인류애가 넘쳐나는 타입이에요. 커피도 이왕 마실거면 친환경 빨대, 재사용 가능한 컵으로!",
      "오지랖이 넓다는 소리를 들어요. 친구와 단골 카페에 간 당신! 맛있는 메뉴를 꼭 추천해요.",
      "대가 없는 베풂도 괜찮은 당신! 내가 싫어하는 카페라도, 친구가 좋아한다면 같이가요.",
      "군중을 이끄는 뛰어난 리더십이 있어서, 어떤 카페를 갈지 정할 때 주도하는 편이에요.",
      "남의 마음을 읽는 능력이 뛰어나고, 상대의 기분을 잘 이해해주는 자상한 성격의 소유자!",
      "도움을 주기 위해 적극적으로 나서는 당신! 카페에서 도움이 필요한 사람을 보면 나도 모르게 몸이 먼저 움직여요.",
      "우유부단하기도 해요. 이 메뉴도 좋고, 저 메뉴도 좋은데... 뭘 마실지 고민할 때가 있어요.",
    ],
    like: 6,
    hate: 7,
  },
  {
    //민트초코프라푸치노
    id: 4,
    score_min: 15,
    score_max: 17,
    title: "민트 초코 프라푸치노",
    sub_title: "“새로운 메뉴를 좋아하는 당신은 민트 초코 프라푸치노”",
    contents: [
      "감정의 기복이 커요.",
      "즐거워 보이는 일에는 뭐든지 하고 싶어하는 호기심이 넘치는 사람이에요. 디테일한 인테리어 소품에 기웃기웃 해요.",
      "SNS에서 핫한 카페를 찾아다녀요! 특히 사진 찍기 좋은 카페라면 쵝오!",
      "벼락치기 해놓고, 점수가 잘 나오길 바라요.",
      "매사에 열정적인 당신, 그러나 그 의지는 작심삼일이에요.",
      "탐험가인 당신, 항상 새로운 가능성에 도전하려고 해요. 항상 가던 카페에서 새로운 메뉴가 나오면 먹어봐야해요.",
      "밋밋한 것은 금방 싫증나요. 새로운 트렌드를 따라가는것을 좋아해서, 새로운 테마의 카페가 나타나면 꼭 가봐요.",
    ],
    like: 8,
    hate: 6,
  },
  {
    //에스프레소
    id: 5,
    score_min: 13,
    score_max: 15,
    title: "에스프레소",
    sub_title: "“청렴결백한 논리주의자인 당신은 에스프레소”",
    contents: [
      "메뉴는 항상 먹던 그걸로 주세요. 보수적인 편이라 새로운 도전은 잘 하지 않아요.",
      "휴일에도 집에 있는 것을 선호해요. 미리 잡힌 약속만이 나를 불러낼 수 있어요.",
      "예고없는 변화는 받아들이기 어려워요. 약속장소는 웬만하면 변경되지 않았으면 좋겠어요.",
      "불편한 점이 있어도 잘 말하지 못해요. 참고 참고 참았다가 터뜨리는 편이에요.",
      "전통적인 가치관을 중시해서, 쓸데없이 도전적인 메뉴를 보면 이해가 안가요.",
      "때때로 통제하려는 경향이 있어서, 메뉴가 통일되면 기분이 좋아져요.",
      "철저하고 신중한 성격이라, 친구들의 취향을 고려하여 이왕이면 모두가 만족할 수 있는 카페를 찾아요.",
    ],
    like: 7,
    hate: 4,
  },
  {
    //페퍼민트티
    id: 6,
    score_min: 11,
    score_max: 13,
    title: "아이스 페퍼민트 티",
    sub_title: "“모든 일을 굳이라고 생각하는 당신은 아이스 페퍼민트 티”",
    contents: [
      "마음에 없는 얘기를 상대방 기분 때문에 하지 않아요.",
      "남의 일에 무관심한 편이에요.",
      "평소엔 조용한 편이지만 필요에 의해 리액션을 잘할 수 있어요.",
      "친구와 선호하는 카페가 다르다면 혼자가도 상관없어요.",
      "멀리 돌아가는 카페는 별로에요. 가능한 내 에너지를 아끼고 싶어요.",
      "손재주가 좋아 어떤 레시피의 커피도 잘 만들 수 있어요.",
      "감정적인 리뷰보다 사실에 기반된 리뷰가 많은 카페가 좋아요.",
    ],
    like: 1,
    hate: 3,
  },
  {
    //아이스 카페라떼
    id: 7,
    score_min: 9,
    score_max: 11,
    title: "아이스 카페라떼",
    sub_title: "“웬만해선 다 괜찮은 당신은 아이스 카페라떼”",
    contents: [
      "분쟁을 싫어하는 평화주의자라 어떤 카페도 잘 따라가요.",
      "여기저기 다른 카페, 다른 자리로 가자는 친구와 함께 있으면 좀 지쳐요.",
      "리뷰를 후하게 주지만 속으로 만점까진 아니라 생각해요.",
      "내 취향에 참견하고 훈수두는 사람은 싫어요.",
      "평범한 카페라도 BGM이 좋으면 좀 달라보여요.",
      "친구가 약속을 취소하면 오히려 좋아요.",
      "내적 관종끼가 있지만 귀차니즘이 더 커요.",
    ],
    like: 3,
    hate: 4,
  },
  {
    //핸드드립커피
    id: 8,
    score_min: 0,
    score_max: 9,
    title: "핸드드립 커피",
    sub_title: "“한 잔도 허투루 마시지 않는 당신은 핸드드립 커피”",
    contents: [
      "은근히 결단력 있는 당신! 카페에 가자는 친구의 제안도 내가 싫다면 단호하게 거절할 수 있어요.",
      "남에게 민폐 끼치는 것을 좋아하지 않아요. 내가 마신 커피는 확실하게 정리하는 편!",
      "맛없는 커피를 마시면 화가 나는 완벽주의적 성향으로 커피를 잘 내리는 카페는 내 지도의 저장!",
      "친구들 여러명과 함께 카페에 가기로 한 당신! 머릿속으로 상상해보고 지쳐서 실제 약속에는 불참해요.",
      "몽환적이고 신비로운 인테리어의 카페에 가는 것을 좋아해요.",
      "이 카페 너무 좋다~ (흠.. 여긴 BGM이 별로네) 겉으로는 공감하지만 속으로는 비판적일 수 있어요!",
    ],
    like: 2,
    hate: 5,
  },
];
